// กำหนดโครงสร้างข้อมูลสำหรับโพสต์
export interface Post {
  content: string; 
  // เนื้อหาของโพสต์ เป็นข้อความ (string) เช่น ข้อความที่ผู้ใช้พิมพ์
  imgFiles: File[]; 
  // ไฟล์รูปภาพที่แนบมากับโพสต์ เป็น Array ของไฟล์ (File)
  user: string; 
  // ชื่อผู้ใช้ที่สร้างโพสต์ เป็นข้อความ
  user_id: string; 
  // ไอดีของผู้ใช้ที่สร้างโพสต์ เป็นข้อความ
}

// กำหนดค่าเริ่มต้น (initial state) สำหรับข้อมูลโพสต์
export const initialPostData: Post = {
  content: '', 
  // เริ่มต้นเนื้อหาโพสต์เป็นข้อความว่าง (ไม่มีเนื้อหา)
  imgFiles: [], 
  // เริ่มต้นไฟล์รูปภาพเป็น Array ว่าง (ไม่มีรูปแนบ)
  user: '', 
  // เริ่มต้นชื่อผู้ใช้เป็นข้อความว่าง (ยังไม่ได้ระบุชื่อผู้ใช้)
  user_id: '', 
  // เริ่มต้นไอดีผู้ใช้เป็นข้อความว่าง (ยังไม่มีไอดีผู้ใช้)
};
